Ran Apply for dir: `.` workspace: `production`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform apply -input=false -no-color" in "/home/ubuntu/.atlantis/repos/1995navinkumar/terraform/19/production": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sknk/production/runs/run-zViVXnGogZRARngz

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.kubernetes.module.test-server.helm_release.test-server: Refreshing state... [id=test-server]
module.kubernetes.module.react-starter-vite.helm_release.react-starter-vite: Refreshing state... [id=react-starter-vite]
module.kubernetes.module.whoami.helm_release.whoami: Refreshing state... [id=whoami]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-namespace: Refreshing state...
module.kubernetes.module.grafana.kubernetes_manifest.grafana-namespace: Refreshing state...
module.kubernetes.module.storage-class.kubernetes_manifest.local-storage-class: Refreshing state...
module.kubernetes.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.grafana.helm_release.grafana: Refreshing state... [id=grafana]
module.kubernetes.module.grafana.helm_release.promtail: Refreshing state... [id=promtail]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress-middleware: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.loki will be created
  + resource "helm_release" "loki" {
      + atomic                     = false
      + chart                      = "loki"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                write:
                  persistence:
                    size: 3Gi
                read:
                  persistence:
                    size: 3Gi
                backend:
                  persistence:
                    size: 3Gi
            EOT,
        ]
      + verify                     = false
      + version                    = "5.35.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.kubernetes.module.storage.kubernetes_manifest.local-storage-class will be created
  + resource "kubernetes_manifest" "local-storage-class" {
      + manifest = {
          + apiVersion        = "storage.k8s.io/v1"
          + kind              = "StorageClass"
          + metadata          = {
              + annotations = {
                  + "storageclass.kubernetes.io/is-default-class" = "true"
                }
              + name        = "local-storage-class"
            }
          + provisioner       = "kubernetes.io/no-provisioner"
          + reclaimPolicy     = "Delete"
          + volumeBindingMode = "WaitForFirstConsumer"
        }
      + object   = {
          + allowVolumeExpansion = (known after apply)
          + allowedTopologies    = (known after apply)
          + apiVersion           = "storage.k8s.io/v1"
          + kind                 = "StorageClass"
          + metadata             = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "local-storage-class"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + mountOptions         = (known after apply)
          + parameters           = (known after apply)
          + provisioner          = "kubernetes.io/no-provisioner"
          + reclaimPolicy        = "Delete"
          + volumeBindingMode    = "WaitForFirstConsumer"
        }
    }

  # module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_1 will be created
  + resource "kubernetes_manifest" "persistent-volume-3Gi_1" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "PersistentVolume"
          + metadata   = {
              + name = "persistent-volume-3Gi_1"
            }
          + spec       = {
              + accessModes                   = [
                  + "ReadWriteOnce",
                  + "ReadOnlyMany",
                  + "ReadWriteMany",
                ]
              + capacity                      = {
                  + storage = "3Gi"
                }
              + local                         = {
                  + path = "/mnt/block-storage"
                }
              + nodeAffinity                  = {
                  + required = {
                      + nodeSelectorTerms = [
                          + {
                              + matchExpressions = [
                                  + {
                                      + key      = "kubernetes.io/hostname"
                                      + operator = "In"
                                      + values   = [
                                          + "arm-instance",
                                        ]
                                    },
                                ]
                            },
                        ]
                    }
                }
              + persistentVolumeReclaimPolicy = "Retain"
              + storageClassName              = "local-storage-class"
              + volumeMode                    = "Filesystem"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + kind       = "PersistentVolume"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "persistent-volume-3Gi_1"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + accessModes                   = [
                  + "ReadWriteOnce",
                  + "ReadOnlyMany",
                  + "ReadWriteMany",
                ]
              + awsElasticBlockStore          = {
                  + fsType    = (known after apply)
                  + partition = (known after apply)
                  + readOnly  = (known after apply)
                  + volumeID  = (known after apply)
                }
              + azureDisk                     = {
                  + cachingMode = (known after apply)
                  + diskName    = (known after apply)
                  + diskURI     = (known after apply)
                  + fsType      = (known after apply)
                  + kind        = (known after apply)
                  + readOnly    = (known after apply)
                }
              + azureFile                     = {
                  + readOnly        = (known after apply)
                  + secretName      = (known after apply)
                  + secretNamespace = (known after apply)
                  + shareName       = (known after apply)
                }
              + capacity                      = {
                  + storage = "3Gi"
                }
              + cephfs                        = {
                  + monitors   = (known after apply)
                  + path       = (known after apply)
                  + readOnly   = (known after apply)
                  + secretFile = (known after apply)
                  + secretRef  = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + user       = (known after apply)
                }
              + cinder                        = {
                  + fsType    = (known after apply)
                  + readOnly  = (known after apply)
                  + secretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + volumeID  = (known after apply)
                }
              + claimRef                      = {
                  + apiVersion      = (known after apply)
                  + fieldPath       = (known after apply)
                  + kind            = (known after apply)
                  + name            = (known after apply)
                  + namespace       = (known after apply)
                  + resourceVersion = (known after apply)
                  + uid             = (known after apply)
                }
              + csi                           = {
                  + controllerExpandSecretRef  = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + controllerPublishSecretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + driver                     = (known after apply)
                  + fsType                     = (known after apply)
                  + nodeExpandSecretRef        = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + nodePublishSecretRef       = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + nodeStageSecretRef         = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + readOnly                   = (known after apply)
                  + volumeAttributes           = (known after apply)
                  + volumeHandle               = (known after apply)
                }
              + fc                            = {
                  + fsType     = (known after apply)
                  + lun        = (known after apply)
                  + readOnly   = (known after apply)
                  + targetWWNs = (known after apply)
                  + wwids      = (known after apply)
                }
              + flexVolume                    = {
                  + driver    = (known after apply)
                  + fsType    = (known after apply)
                  + options   = (known after apply)
                  + readOnly  = (known after apply)
                  + secretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                }
              + flocker                       = {
                  + datasetName = (known after apply)
                  + datasetUUID = (known after apply)
                }
              + gcePersistentDisk             = {
                  + fsType    = (known after apply)
                  + partition = (known after apply)
                  + pdName    = (known after apply)
                  + readOnly  = (known after apply)
                }
              + glusterfs                     = {
                  + endpoints          = (known after apply)
                  + endpointsNamespace = (known after apply)
                  + path               = (known after apply)
                  + readOnly           = (known after apply)
                }
              + hostPath                      = {
                  + path = (known after apply)
                  + type = (known after apply)
                }
              + iscsi                         = {
                  + chapAuthDiscovery = (known after apply)
                  + chapAuthSession   = (known after apply)
                  + fsType            = (known after apply)
                  + initiatorName     = (known after apply)
                  + iqn               = (known after apply)
                  + iscsiInterface    = (known after apply)
                  + lun               = (known after apply)
                  + portals           = (known after apply)
                  + readOnly          = (known after apply)
                  + secretRef         = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + targetPortal      = (known after apply)
                }
              + local                         = {
                  + fsType = (known after apply)
                  + path   = "/mnt/block-storage"
                }
              + mountOptions                  = (known after apply)
              + nfs                           = {
                  + path     = (known after apply)
                  + readOnly = (known after apply)
                  + server   = (known after apply)
                }
              + nodeAffinity                  = {
                  + required = {
                      + nodeSelectorTerms = [
                          + {
                              + matchExpressions = [
                                  + {
                                      + key      = "kubernetes.io/hostname"
                                      + operator = "In"
                                      + values   = [
                                          + "arm-instance",
                                        ]
                                    },
                                ]
                              + matchFields      = (known after apply)
                            },
                        ]
                    }
                }
              + persistentVolumeReclaimPolicy = "Retain"
              + photonPersistentDisk          = {
                  + fsType = (known after apply)
                  + pdID   = (known after apply)
                }
              + portworxVolume                = {
                  + fsType   = (known after apply)
                  + readOnly = (known after apply)
                  + volumeID = (known after apply)
                }
              + quobyte                       = {
                  + group    = (known after apply)
                  + readOnly = (known after apply)
                  + registry = (known after apply)
                  + tenant   = (known after apply)
                  + user     = (known after apply)
                  + volume   = (known after apply)
                }
              + rbd                           = {
                  + fsType    = (known after apply)
                  + image     = (known after apply)
                  + keyring   = (known after apply)
                  + monitors  = (known after apply)
                  + pool      = (known after apply)
                  + readOnly  = (known after apply)
                  + secretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + user      = (known after apply)
                }
              + scaleIO                       = {
                  + fsType           = (known after apply)
                  + gateway          = (known after apply)
                  + protectionDomain = (known after apply)
                  + readOnly         = (known after apply)
                  + secretRef        = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + sslEnabled       = (known after apply)
                  + storageMode      = (known after apply)
                  + storagePool      = (known after apply)
                  + system           = (known after apply)
                  + volumeName       = (known after apply)
                }
              + storageClassName              = "local-storage-class"
              + storageos                     = {
                  + fsType          = (known after apply)
                  + readOnly        = (known after apply)
                  + secretRef       = {
                      + apiVersion      = (known after apply)
                      + fieldPath       = (known after apply)
                      + kind            = (known after apply)
                      + name            = (known after apply)
                      + namespace       = (known after apply)
                      + resourceVersion = (known after apply)
                      + uid             = (known after apply)
                    }
                  + volumeName      = (known after apply)
                  + volumeNamespace = (known after apply)
                }
              + volumeMode                    = "Filesystem"
              + vsphereVolume                 = {
                  + fsType            = (known after apply)
                  + storagePolicyID   = (known after apply)
                  + storagePolicyName = (known after apply)
                  + volumePath        = (known after apply)
                }
            }
        }
    }

  # module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_2 will be created
  + resource "kubernetes_manifest" "persistent-volume-3Gi_2" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "PersistentVolume"
          + metadata   = {
              + name = "persistent-volume-3Gi_2"
            }
          + spec       = {
              + accessModes                   = [
                  + "ReadWriteOnce",
                  + "ReadOnlyMany",
                  + "ReadWriteMany",
                ]
              + capacity                      = {
                  + storage = "3Gi"
                }
              + local                         = {
                  + path = "/mnt/block-storage"
                }
              + nodeAffinity                  = {
                  + required = {
                      + nodeSelectorTerms = [
                          + {
                              + matchExpressions = [
                                  + {
                                      + key      = "kubernetes.io/hostname"
                                      + operator = "In"
                                      + values   = [
                                          + "arm-instance",
                                        ]
                                    },
                                ]
                            },
                        ]
                    }
                }
              + persistentVolumeReclaimPolicy = "Retain"
              + storageClassName              = "local-storage-class"
              + volumeMode                    = "Filesystem"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + kind       = "PersistentVolume"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "persistent-volume-3Gi_2"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + accessModes                   = [
                  + "ReadWriteOnce",
                  + "ReadOnlyMany",
                  + "ReadWriteMany",
                ]
              + awsElasticBlockStore          = {
                  + fsType    = (known after apply)
                  + partition = (known after apply)
                  + readOnly  = (known after apply)
                  + volumeID  = (known after apply)
                }
              + azureDisk                     = {
                  + cachingMode = (known after apply)
                  + diskName    = (known after apply)
                  + diskURI     = (known after apply)
                  + fsType      = (known after apply)
                  + kind        = (known after apply)
                  + readOnly    = (known after apply)
                }
              + azureFile                     = {
                  + readOnly        = (known after apply)
                  + secretName      = (known after apply)
                  + secretNamespace = (known after apply)
                  + shareName       = (known after apply)
                }
              + capacity                      = {
                  + storage = "3Gi"
                }
              + cephfs                        = {
                  + monitors   = (known after apply)
                  + path       = (known after apply)
                  + readOnly   = (known after apply)
                  + secretFile = (known after apply)
                  + secretRef  = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + user       = (known after apply)
                }
              + cinder                        = {
                  + fsType    = (known after apply)
                  + readOnly  = (known after apply)
                  + secretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + volumeID  = (known after apply)
                }
              + claimRef                      = {
                  + apiVersion      = (known after apply)
                  + fieldPath       = (known after apply)
                  + kind            = (known after apply)
                  + name            = (known after apply)
                  + namespace       = (known after apply)
                  + resourceVersion = (known after apply)
                  + uid             = (known after apply)
                }
              + csi                           = {
                  + controllerExpandSecretRef  = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + controllerPublishSecretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + driver                     = (known after apply)
                  + fsType                     = (known after apply)
                  + nodeExpandSecretRef        = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + nodePublishSecretRef       = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + nodeStageSecretRef         = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + readOnly                   = (known after apply)
                  + volumeAttributes           = (known after apply)
                  + volumeHandle               = (known after apply)
                }
              + fc                            = {
                  + fsType     = (known after apply)
                  + lun        = (known after apply)
                  + readOnly   = (known after apply)
                  + targetWWNs = (known after apply)
                  + wwids      = (known after apply)
                }
              + flexVolume                    = {
                  + driver    = (known after apply)
                  + fsType    = (known after apply)
                  + options   = (known after apply)
                  + readOnly  = (known after apply)
                  + secretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                }
              + flocker                       = {
                  + datasetName = (known after apply)
                  + datasetUUID = (known after apply)
                }
              + gcePersistentDisk             = {
                  + fsType    = (known after apply)
                  + partition = (known after apply)
                  + pdName    = (known after apply)
                  + readOnly  = (known after apply)
                }
              + glusterfs                     = {
                  + endpoints          = (known after apply)
                  + endpointsNamespace = (known after apply)
                  + path               = (known after apply)
                  + readOnly           = (known after apply)
                }
              + hostPath                      = {
                  + path = (known after apply)
                  + type = (known after apply)
                }
              + iscsi                         = {
                  + chapAuthDiscovery = (known after apply)
                  + chapAuthSession   = (known after apply)
                  + fsType            = (known after apply)
                  + initiatorName     = (known after apply)
                  + iqn               = (known after apply)
                  + iscsiInterface    = (known after apply)
                  + lun               = (known after apply)
                  + portals           = (known after apply)
                  + readOnly          = (known after apply)
                  + secretRef         = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + targetPortal      = (known after apply)
                }
              + local                         = {
                  + fsType = (known after apply)
                  + path   = "/mnt/block-storage"
                }
              + mountOptions                  = (known after apply)
              + nfs                           = {
                  + path     = (known after apply)
                  + readOnly = (known after apply)
                  + server   = (known after apply)
                }
              + nodeAffinity                  = {
                  + required = {
                      + nodeSelectorTerms = [
                          + {
                              + matchExpressions = [
                                  + {
                                      + key      = "kubernetes.io/hostname"
                                      + operator = "In"
                                      + values   = [
                                          + "arm-instance",
                                        ]
                                    },
                                ]
                              + matchFields      = (known after apply)
                            },
                        ]
                    }
                }
              + persistentVolumeReclaimPolicy = "Retain"
              + photonPersistentDisk          = {
                  + fsType = (known after apply)
                  + pdID   = (known after apply)
                }
              + portworxVolume                = {
                  + fsType   = (known after apply)
                  + readOnly = (known after apply)
                  + volumeID = (known after apply)
                }
              + quobyte                       = {
                  + group    = (known after apply)
                  + readOnly = (known after apply)
                  + registry = (known after apply)
                  + tenant   = (known after apply)
                  + user     = (known after apply)
                  + volume   = (known after apply)
                }
              + rbd                           = {
                  + fsType    = (known after apply)
                  + image     = (known after apply)
                  + keyring   = (known after apply)
                  + monitors  = (known after apply)
                  + pool      = (known after apply)
                  + readOnly  = (known after apply)
                  + secretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + user      = (known after apply)
                }
              + scaleIO                       = {
                  + fsType           = (known after apply)
                  + gateway          = (known after apply)
                  + protectionDomain = (known after apply)
                  + readOnly         = (known after apply)
                  + secretRef        = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + sslEnabled       = (known after apply)
                  + storageMode      = (known after apply)
                  + storagePool      = (known after apply)
                  + system           = (known after apply)
                  + volumeName       = (known after apply)
                }
              + storageClassName              = "local-storage-class"
              + storageos                     = {
                  + fsType          = (known after apply)
                  + readOnly        = (known after apply)
                  + secretRef       = {
                      + apiVersion      = (known after apply)
                      + fieldPath       = (known after apply)
                      + kind            = (known after apply)
                      + name            = (known after apply)
                      + namespace       = (known after apply)
                      + resourceVersion = (known after apply)
                      + uid             = (known after apply)
                    }
                  + volumeName      = (known after apply)
                  + volumeNamespace = (known after apply)
                }
              + volumeMode                    = "Filesystem"
              + vsphereVolume                 = {
                  + fsType            = (known after apply)
                  + storagePolicyID   = (known after apply)
                  + storagePolicyName = (known after apply)
                  + volumePath        = (known after apply)
                }
            }
        }
    }

  # module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_3 will be created
  + resource "kubernetes_manifest" "persistent-volume-3Gi_3" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "PersistentVolume"
          + metadata   = {
              + name = "persistent-volume-3Gi_3"
            }
          + spec       = {
              + accessModes                   = [
                  + "ReadWriteOnce",
                  + "ReadOnlyMany",
                  + "ReadWriteMany",
                ]
              + capacity                      = {
                  + storage = "3Gi"
                }
              + local                         = {
                  + path = "/mnt/block-storage"
                }
              + nodeAffinity                  = {
                  + required = {
                      + nodeSelectorTerms = [
                          + {
                              + matchExpressions = [
                                  + {
                                      + key      = "kubernetes.io/hostname"
                                      + operator = "In"
                                      + values   = [
                                          + "arm-instance",
                                        ]
                                    },
                                ]
                            },
                        ]
                    }
                }
              + persistentVolumeReclaimPolicy = "Retain"
              + storageClassName              = "local-storage-class"
              + volumeMode                    = "Filesystem"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + kind       = "PersistentVolume"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "persistent-volume-3Gi_3"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + accessModes                   = [
                  + "ReadWriteOnce",
                  + "ReadOnlyMany",
                  + "ReadWriteMany",
                ]
              + awsElasticBlockStore          = {
                  + fsType    = (known after apply)
                  + partition = (known after apply)
                  + readOnly  = (known after apply)
                  + volumeID  = (known after apply)
                }
              + azureDisk                     = {
                  + cachingMode = (known after apply)
                  + diskName    = (known after apply)
                  + diskURI     = (known after apply)
                  + fsType      = (known after apply)
                  + kind        = (known after apply)
                  + readOnly    = (known after apply)
                }
              + azureFile                     = {
                  + readOnly        = (known after apply)
                  + secretName      = (known after apply)
                  + secretNamespace = (known after apply)
                  + shareName       = (known after apply)
                }
              + capacity                      = {
                  + storage = "3Gi"
                }
              + cephfs                        = {
                  + monitors   = (known after apply)
                  + path       = (known after apply)
                  + readOnly   = (known after apply)
                  + secretFile = (known after apply)
                  + secretRef  = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + user       = (known after apply)
                }
              + cinder                        = {
                  + fsType    = (known after apply)
                  + readOnly  = (known after apply)
                  + secretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + volumeID  = (known after apply)
                }
              + claimRef                      = {
                  + apiVersion      = (known after apply)
                  + fieldPath       = (known after apply)
                  + kind            = (known after apply)
                  + name            = (known after apply)
                  + namespace       = (known after apply)
                  + resourceVersion = (known after apply)
                  + uid             = (known after apply)
                }
              + csi                           = {
                  + controllerExpandSecretRef  = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + controllerPublishSecretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + driver                     = (known after apply)
                  + fsType                     = (known after apply)
                  + nodeExpandSecretRef        = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + nodePublishSecretRef       = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + nodeStageSecretRef         = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + readOnly                   = (known after apply)
                  + volumeAttributes           = (known after apply)
                  + volumeHandle               = (known after apply)
                }
              + fc                            = {
                  + fsType     = (known after apply)
                  + lun        = (known after apply)
                  + readOnly   = (known after apply)
                  + targetWWNs = (known after apply)
                  + wwids      = (known after apply)
                }
              + flexVolume                    = {
                  + driver    = (known after apply)
                  + fsType    = (known after apply)
                  + options   = (known after apply)
                  + readOnly  = (known after apply)
                  + secretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                }
              + flocker                       = {
                  + datasetName = (known after apply)
                  + datasetUUID = (known after apply)
                }
              + gcePersistentDisk             = {
                  + fsType    = (known after apply)
                  + partition = (known after apply)
                  + pdName    = (known after apply)
                  + readOnly  = (known after apply)
                }
              + glusterfs                     = {
                  + endpoints          = (known after apply)
                  + endpointsNamespace = (known after apply)
                  + path               = (known after apply)
                  + readOnly           = (known after apply)
                }
              + hostPath                      = {
                  + path = (known after apply)
                  + type = (known after apply)
                }
              + iscsi                         = {
                  + chapAuthDiscovery = (known after apply)
                  + chapAuthSession   = (known after apply)
                  + fsType            = (known after apply)
                  + initiatorName     = (known after apply)
                  + iqn               = (known after apply)
                  + iscsiInterface    = (known after apply)
                  + lun               = (known after apply)
                  + portals           = (known after apply)
                  + readOnly          = (known after apply)
                  + secretRef         = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + targetPortal      = (known after apply)
                }
              + local                         = {
                  + fsType = (known after apply)
                  + path   = "/mnt/block-storage"
                }
              + mountOptions                  = (known after apply)
              + nfs                           = {
                  + path     = (known after apply)
                  + readOnly = (known after apply)
                  + server   = (known after apply)
                }
              + nodeAffinity                  = {
                  + required = {
                      + nodeSelectorTerms = [
                          + {
                              + matchExpressions = [
                                  + {
                                      + key      = "kubernetes.io/hostname"
                                      + operator = "In"
                                      + values   = [
                                          + "arm-instance",
                                        ]
                                    },
                                ]
                              + matchFields      = (known after apply)
                            },
                        ]
                    }
                }
              + persistentVolumeReclaimPolicy = "Retain"
              + photonPersistentDisk          = {
                  + fsType = (known after apply)
                  + pdID   = (known after apply)
                }
              + portworxVolume                = {
                  + fsType   = (known after apply)
                  + readOnly = (known after apply)
                  + volumeID = (known after apply)
                }
              + quobyte                       = {
                  + group    = (known after apply)
                  + readOnly = (known after apply)
                  + registry = (known after apply)
                  + tenant   = (known after apply)
                  + user     = (known after apply)
                  + volume   = (known after apply)
                }
              + rbd                           = {
                  + fsType    = (known after apply)
                  + image     = (known after apply)
                  + keyring   = (known after apply)
                  + monitors  = (known after apply)
                  + pool      = (known after apply)
                  + readOnly  = (known after apply)
                  + secretRef = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + user      = (known after apply)
                }
              + scaleIO                       = {
                  + fsType           = (known after apply)
                  + gateway          = (known after apply)
                  + protectionDomain = (known after apply)
                  + readOnly         = (known after apply)
                  + secretRef        = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + sslEnabled       = (known after apply)
                  + storageMode      = (known after apply)
                  + storagePool      = (known after apply)
                  + system           = (known after apply)
                  + volumeName       = (known after apply)
                }
              + storageClassName              = "local-storage-class"
              + storageos                     = {
                  + fsType          = (known after apply)
                  + readOnly        = (known after apply)
                  + secretRef       = {
                      + apiVersion      = (known after apply)
                      + fieldPath       = (known after apply)
                      + kind            = (known after apply)
                      + name            = (known after apply)
                      + namespace       = (known after apply)
                      + resourceVersion = (known after apply)
                      + uid             = (known after apply)
                    }
                  + volumeName      = (known after apply)
                  + volumeNamespace = (known after apply)
                }
              + volumeMode                    = "Filesystem"
              + vsphereVolume                 = {
                  + fsType            = (known after apply)
                  + storagePolicyID   = (known after apply)
                  + storagePolicyName = (known after apply)
                  + volumePath        = (known after apply)
                }
            }
        }
    }

  # module.kubernetes.module.storage-class.kubernetes_manifest.local-storage-class will be destroyed
  - resource "kubernetes_manifest" "local-storage-class" {
      - manifest = {
          - apiVersion        = "storage.k8s.io/v1"
          - kind              = "StorageClass"
          - metadata          = {
              - annotations = {
                  - "storageclass.kubernetes.io/is-default-class" = "true"
                }
              - name        = "local-storage-class"
            }
          - provisioner       = "kubernetes.io/no-provisioner"
          - reclaimPolicy     = "Delete"
          - volumeBindingMode = "WaitForFirstConsumer"
        } -> null
      - object   = {
          - allowVolumeExpansion = null
          - allowedTopologies    = null
          - apiVersion           = "storage.k8s.io/v1"
          - kind                 = "StorageClass"
          - metadata             = {
              - annotations                = {
                  - "storageclass.kubernetes.io/is-default-class" = "true"
                }
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "local-storage-class"
              - namespace                  = null
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - mountOptions         = null
          - parameters           = null
          - provisioner          = "kubernetes.io/no-provisioner"
          - reclaimPolicy        = "Delete"
          - volumeBindingMode    = "WaitForFirstConsumer"
        } -> null
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>